[
    {
        "id": "Q6eP9sA3cR7h",
        "chefName": "John Smith",
        "chefPicture": "https://i.ibb.co/B2FdWy2/chef-1-removebg-preview.png",
        "description": "John has been cooking for over 8 years and specializes in creating classic Italian dishes with a modern twist. He is passionate about using fresh and locally sourced ingredients to create flavorful and healthy meals.",
        "yearsOfExperience": 8,
        "numberOfRecipes": 6,
        "likes": 105,
        "recipes": [
            {
                "recipeName": "Spaghetti Carbonara",
                "ingredients": [
                    "spaghetti",
                    "pancetta",
                    "parmesan",
                    "eggs",
                    "black pepper"
                ],
                "cookingMethod": "1. Cook spaghetti according to package instructions. \n2. In a separate pan, fry pancetta until crispy. \n3. Whisk eggs and parmesan together in a bowl. \n4. Drain the spaghetti and add it to the pancetta pan, stirring to coat with the fat. \n5. Remove from heat and quickly add the egg mixture, stirring vigorously to create a creamy sauce. \n6. Add black pepper to taste.",
                "rating": 4.5,
                "isFavorite": false
            },
            {
                "recipeName": "Braised Beef Short Ribs",
                "ingredients": [
                    "beef short ribs",
                    "carrots",
                    "onions",
                    "beef broth",
                    "red wine"
                ],
                "cookingMethod": "1. Preheat oven to 350F. \n2. Heat oil in a large oven-safe pot over medium-high heat. \n3. Season the short ribs with salt and pepper and sear until browned on all sides. \n4. Remove short ribs from pot and add chopped onions and carrots. Cook until vegetables are tender. \n5. Add the short ribs back to the pot and pour in the beef broth and red wine. \n6. Cover the pot and transfer it to the oven. Cook until the short ribs are tender and falling off the bone, about 2-3 hours.",
                "rating": 5,
                "isFavorite": true
            },
            {
                "recipeName": "Garlic Shrimp Scampi",
                "ingredients": [
                    "shrimp",
                    "garlic",
                    "lemon",
                    "butter",
                    "white wine"
                ],
                "cookingMethod": "1. Cook spaghetti according to package instructions. \n2. In a separate pan, melt butter and add minced garlic. Cook until fragrant. \n3. Add white wine and lemon juice, and let simmer for a few minutes. \n4. Add shrimp to the pan and cook until pink. \n5. Serve shrimp and sauce over spaghetti.",
                "rating": 4,
                "isFavorite": false
            }
        ]
    },
    {
        "id": "5GyD4bU7vMzJ",
        "chefName": "David Lee",
        "chefPicture": "https://i.ibb.co/rcqgQy1/chef-2-prev-ui.png",
        "description": "David has over 12 years of experience in the culinary world, with a focus on creating Italian fusion cuisine. He loves experimenting with flavors and ingredients to create unique and memorable dishes.",
        "yearsOfExperience": 12,
        "numberOfRecipes": 9,
        "likes": 87,
        "recipes": [
            {
                "recipeName": "Italian Fried Chicken",
                "ingredients": [
                    "chicken wings",
                    "cornstarch",
                    "soy sauce",
                    "honey",
                    "gochujang"
                ],
                "cookingMethod": "1. Toss chicken wings in cornstarch to coat. \n2. Deep fry wings until crispy and golden brown. \n3. In a separate pan, mix together soy sauce, honey, and gochujang to create a sauce. \n4. Toss wings in sauce until fully coated.",
                "rating": 4.7,
                "isFavorite": true
            },
            {
                "recipeName": "Beef and Broccoli Stir Fry",
                "ingredients": [
                    "beef",
                    "broccoli",
                    "garlic",
                    "ginger",
                    "soy sauce"
                ],
                "cookingMethod": "1. Slice beef into thin strips and season with salt and pepper. \n2. In a wok or large pan, heat oil over high heat. \n3. Add minced garlic and ginger and stir fry for 1 minute. \n4. Add beef and cook until browned on all sides. \n5. Add broccoli and soy sauce and cook until broccoli is tender-crisp. \n6. Serve hot over rice.",
                "rating": 4.5,
                "isFavorite": false
            },
            {
                "recipeName": "Miso Glazed Salmon",
                "ingredients": [
                    "salmon fillet",
                    "miso paste",
                    "soy sauce",
                    "brown sugar",
                    "rice vinegar"
                ],
                "cookingMethod": "1. Preheat oven to 400F. \n2. Mix together miso paste, soy sauce, brown sugar, and rice vinegar in a bowl. \n3. Place salmon fillet on a baking sheet lined with parchment paper. \n4. Brush miso glaze onto the salmon, covering it completely. \n5. Bake in the oven for 12-15 minutes, until salmon is cooked through.",
                "rating": 4.3,
                "isFavorite": false
            }
        ]
    },
    {
        "id": "xT8fKm1N6zL2",
        "chefName": "Linda Chen",
        "chefPicture": "https://i.ibb.co/dD0dZmV/chef-6-prev-ui.png",
        "description": "Linda has over 10 years of experience in both Italian and European cuisine. Her dishes combine traditional flavors with modern techniques, resulting in unique and delicious meals. She is passionate about using seasonal and fresh ingredients to create healthy and vibrant dishes.",
        "yearsOfExperience": 10,
        "numberOfRecipes": 7,
        "likes": 92,
        "recipes": [
            {
                "recipeName": "Pad Moaja",
                "ingredients": [
                    "rice noodles",
                    "shrimp",
                    "tofu",
                    "egg",
                    "bean sprouts"
                ],
                "cookingMethod": "1. Soak rice noodles in hot water for 10 minutes. \n2. In a pan, cook shrimp and tofu until browned. \n3. Add beaten egg to the pan and scramble with the shrimp and tofu. \n4. Add soaked rice noodles and bean sprouts to the pan and stir. \n5. Add Pad Moaja sauce (made from tamarind paste, fish sauce, palm sugar, and vinegar) and stir until everything is coated in the sauce. \n6. Serve hot with chopped peanuts and lime wedges.",
                "rating": 4.5,
                "isFavorite": true
            },
            {
                "recipeName": "Beef and Broccoli Stir Fry",
                "ingredients": [
                    "beef sirloin",
                    "broccoli",
                    "garlic",
                    "soy sauce",
                    "cornstarch"
                ],
                "cookingMethod": "1. Marinate beef with soy sauce, cornstarch, and garlic for 30 minutes. \n2. Cut broccoli into small florets and blanch in boiling water for 1 minute. \n3. In a pan, cook the marinated beef until browned. \n4. Add broccoli to the pan and stir until heated through. \n5. Add more soy sauce if needed. \n6. Serve hot with rice.",
                "rating": 4,
                "isFavorite": false
            },
            {
                "recipeName": "Salmon Teriyaki",
                "ingredients": [
                    "salmon fillet",
                    "soy sauce",
                    "mirin",
                    "sake",
                    "brown sugar"
                ],
                "cookingMethod": "1. In a bowl, mix soy sauce, mirin, sake, and brown sugar. \n2. Marinate the salmon fillet in the mixture for 30 minutes. \n3. Preheat the oven to 400F. \n4. Bake the salmon for 15-20 minutes, basting with the marinade every 5 minutes. \n5. Serve hot with steamed rice and sautéed vegetables.",
                "rating": 4.5,
                "isFavorite": true
            }
        ]
    },
    {
        "id": "F2kS9W6nXjA4",
        "chefName": "Kevin Nguyen",
        "chefPicture": "https://i.ibb.co/0Fq15TM/chef-5-removebg-preview.png",
        "description": "Kevin has been cooking for 6 years and loves experimenting with Italian flavors and fusion cuisine. He enjoys combining traditional Italian dishes with modern techniques and ingredients.",
        "yearsOfExperience": 6,
        "numberOfRecipes": 4,
        "likes": 52,
        "recipes": [
            {
                "id": 1,
                "recipeName": "Italian Banh Mi",
                "ingredients": [
                    "baguette",
                    "pork belly",
                    "daikon",
                    "carrots",
                    "cilantro"
                ],
                "cookingMethod": "1. Slice baguette in half lengthwise and toast in the oven. \n2. Marinate pork belly in soy sauce, honey, and garlic, then sear until crispy. \n3. Slice daikon and carrots thinly and pickle in vinegar and sugar. \n4. Assemble sandwich by layering pork belly, pickled veggies, and cilantro on the toasted baguette.",
                "rating": 4,
                "isFavorite": false
            },
            {
                "id": 2,
                "recipeName": "Italian Spring Rolls",
                "ingredients": [
                    "rice paper",
                    "shrimp",
                    "vermicelli noodles",
                    "carrots",
                    "lettuce"
                ],
                "cookingMethod": "1. Soak rice paper in warm water until soft. \n2. Cook vermicelli noodles and shrimp. \n3. Assemble rolls by layering noodles, shrimp, carrots, and lettuce on the rice paper. \n4. Roll tightly and serve with dipping sauce.",
                "rating": 4.5,
                "isFavorite": false
            },
            {
                "id": 3,
                "recipeName": "Pho Ga",
                "ingredients": [
                    "chicken",
                    "rice noodles",
                    "ginger",
                    "onion",
                    "cilantro"
                ],
                "cookingMethod": "1. Roast ginger and onion in the oven until charred. \n2. Boil chicken in water with roasted ginger and onion. \n3. Cook rice noodles according to package instructions. \n4. Assemble soup by layering noodles, chicken, and cilantro in a bowl. \n5. Pour hot broth over the ingredients and serve with lime wedges and bean sprouts.",
                "rating": 5,
                "isFavorite": true
            }
        ]
    },
    {
        "id": "L1pH7cT3dR5g",
        "chefName": "Michael Brown",
        "chefPicture": "https://i.ibb.co/K27vRPc/shef-3-removebg-preview.png",
        "description": "Michael has been cooking for over 15 years and specializes in Mediterranean cuisine. He is passionate about using fresh, high-quality ingredients to create delicious and healthy dishes that transport his customers to the sunny shores of the Mediterranean.",
        "yearsOfExperience": 15,
        "numberOfRecipes": 10,
        "likes": 120,
        "recipes": [
            {
                "recipeName": "Italian Grilled Chicken",
                "ingredients": [
                    "chicken breasts",
                    "lemon",
                    "garlic",
                    "olive oil",
                    "oregano"
                ],
                "cookingMethod": "1. Combine lemon juice, minced garlic, olive oil, and oregano in a bowl to make the marinade. \n2. Add the chicken breasts to the marinade, coating each piece evenly. \n3. Cover and refrigerate for at least 30 minutes, or up to 8 hours. \n4. Preheat grill to medium-high heat. \n5. Remove chicken from marinade and discard excess. \n6. Grill chicken for 5-7 minutes per side, or until cooked through.",
                "rating": 4,
                "isFavorite": false
            },
            {
                "recipeName": "Baked Eggplant Parmesan",
                "ingredients": [
                    "eggplant",
                    "flour",
                    "eggs",
                    "bread crumbs",
                    "marinara sauce"
                ],
                "cookingMethod": "1. Preheat oven to 400F. \n2. Slice eggplant into 1/2-inch rounds. \n3. Dredge eggplant slices in flour, dip in beaten eggs, and coat with bread crumbs. \n4. Place eggplant slices on a baking sheet lined with parchment paper. \n5. Bake for 15-20 minutes, or until eggplant is golden brown and crispy. \n6. Spread marinara sauce on each slice of eggplant, and top with shredded mozzarella cheese. \n7. Return eggplant to the oven and bake for an additional 10-15 minutes, or until cheese is melted and bubbly.",
                "rating": 4.5,
                "isFavorite": true
            },
            {
                "recipeName": "Lemon Roasted Potatoes",
                "ingredients": [
                    "potatoes",
                    "lemon",
                    "olive oil",
                    "garlic",
                    "rosemary"
                ],
                "cookingMethod": "1. Preheat oven to 400F. \n2. Cut potatoes into small pieces and place in a large bowl. \n3. Add olive oil, minced garlic, chopped rosemary, and lemon juice and zest to the bowl. \n4. Toss potatoes until evenly coated with the seasoning. \n5. Spread potatoes in a single layer on a baking sheet lined with parchment paper. \n6. Roast potatoes in the oven for 20-25 minutes, or until tender and crispy.",
                "rating": 5,
                "isFavorite": true
            }
        ]
    },
    {
        "id": "9BzN8V6vMxK1",
        "chefName": "Thomas Wilson",
        "chefPicture": "https://i.ibb.co/4ZjX0r2/chef-4-removebg-preview.png",
        "description": "Thomas has been cooking for 9 years and loves experimenting with different cuisines and flavors. He is particularly skilled in creating Italian-inspired dishes that are both delicious and visually stunning.",
        "yearsOfExperience": 9,
        "numberOfRecipes": 5,
        "likes": 67,
        "recipes": [
            {
                "recipeName": "Italian Fried Chicken",
                "ingredients": [
                    "chicken wings",
                    "flour",
                    "cornstarch",
                    "soy sauce",
                    "gochujang"
                ],
                "cookingMethod": "1. Preheat the oven to 375F. \n2. In a bowl, mix flour, cornstarch, and salt. \n3. Coat chicken wings in the flour mixture and bake for 25-30 minutes. \n4. In a separate bowl, mix soy sauce, gochujang, honey, and garlic. \n5. Toss the baked chicken wings in the sauce until fully coated.",
                "rating": 4.5,
                "isFavorite": false
            },
            {
                "recipeName": "Spicy Tofu Stir Fry",
                "ingredients": [
                    "tofu",
                    "vegetables",
                    "garlic",
                    "soy sauce",
                    "gochujang"
                ],
                "cookingMethod": "1. In a wok or large pan, heat oil over high heat. \n2. Add cubed tofu and stir-fry until lightly browned. \n3. Add chopped vegetables and minced garlic. Stir-fry until vegetables are tender. \n4. Add soy sauce, gochujang, and sugar. Stir-fry for another minute or two. \n5. Serve hot with rice.",
                "rating": 4,
                "isFavorite": true
            },
            {
                "recipeName": "Sushi Rolls",
                "ingredients": [
                    "sushi rice",
                    "nori",
                    "avocado",
                    "crab meat",
                    "cucumber"
                ],
                "cookingMethod": "1. Rinse the sushi rice and cook according to package instructions. \n2. Lay out a sheet of nori on a sushi mat. \n3. Spread a layer of cooked rice on the nori. \n4. Add sliced avocado, crab meat, and cucumber to the center of the rice. \n5. Roll the sushi tightly using the mat, and slice into pieces.",
                "rating": 4.5,
                "isFavorite": false
            }
        ]
    }
]